app/controllers/connections_controller.rb

  def index
    @user = Person.find(session[:user_id])
    @order = params[:order] ? params[:order] : 'name'
    @connections = Connection.paginate :page => params[:page], :conditions => "person_id = #{session[:user_id]}", :order => @order, :per_page => 10
---
SELECT * FROM `connections`