app/controllers/contacts_controller.rb

SELECT * FROM `contacts`
---
  def index
    authorize Contact
    @contacts = current_user.contacts.asc(:name)
    @contacts = @contacts.where(name: /#{params[:q]}/i) if params[:q]
    if params[:tag]
      @contacts = @contacts.where(tags: /#{params[:tag]}/)
      @tag = params[:tag]
    end
    @contacts = @contacts.page(params[:page])