app/controllers/links_controller.rb

SELECT * FROM `links` WHERE (person_id = 1) ORDER BY last_clicked desc LIMIT 18
---
  def index
    @user = Person.find(session[:user_id])
    unless session[:tags]
      logger.info "session tag list is empty"
      session[:tags] = getUniqueTags
    end
    logger.info "index() user: #{@user.inspect}"
    @recently_clicked = Link.find(:all, :limit => 18, :conditions => "person_id = #{session[:user_id]}", :order => 'last_clicked desc')

SELECT * FROM `links` WHERE (`links`.`id` = 0)
UPDATE `links` SET `clicks` = 390, `last_clicked` = '2010-04-09 21:27:41', `updated_at` = '2010-04-09 21:27:41' WHERE `id` = 92282751
---
  def show
    @link = Link.find(params[:id])

    respond_to do |format|
      format.html {
        @link.update_attributes({'clicks' => @link.clicks += 1, 'last_clicked' => Time.now})