app/controllers/reminders_controller.rb

SELECT * FROM `reminders` ORDER BY due LIMIT 0, 10
---
  def index
    @orderBy = params[:orderBy] ? params[:orderBy] : 'due'
    @reminders = Reminder.paginate :page => params[:page], :order => @orderBy, :per_page => 10